{
  "<PAD>": 0,
  "<UNK>": 1,
  "<EMOTION_ANGRY>": 2,
  "<EMOTION_EXCITING>": 3,
  "<EMOTION_FEAR>": 4,
  "<EMOTION_FUNNY>": 5,
  "<EMOTION_HAPPY>": 6,
  "<EMOTION_LAZY>": 7,
  "<EMOTION_MAGNIFICENT>": 8,
  "<EMOTION_QUIET>": 9,
  "<EMOTION_ROMANTIC>": 10,
  "<EMOTION_SAD>": 11,
  "<EMOTION_WARM>": 12,
  "<GENRE_CLASSICAL>": 13,
  "<GENRE_COUNTRY>": 14,
  "<GENRE_JAZZ>": 15,
  "<GENRE_POP>": 16,
  "<GENRE_ROCK>": 17,
  "<GENRE_TRADITIONAL>": 18,
  "TIME_SHIFT_10": 19,
  "TIME_SHIFT_20": 20,
  "TIME_SHIFT_40": 21,
  "TIME_SHIFT_80": 22,
  "TIME_SHIFT_160": 23,
  "TIME_SHIFT_320": 24,
  "TIME_SHIFT_640": 25,
  "VELOCITY_0": 26,
  "VELOCITY_1": 27,
  "VELOCITY_2": 28,
  "VELOCITY_3": 29,
  "VELOCITY_4": 30,
  "VELOCITY_5": 31,
  "VELOCITY_6": 32,
  "VELOCITY_7": 33,
  "VELOCITY_8": 34,
  "VELOCITY_9": 35,
  "VELOCITY_10": 36,
  "VELOCITY_11": 37,
  "VELOCITY_12": 38,
  "VELOCITY_13": 39,
  "VELOCITY_14": 40,
  "VELOCITY_15": 41,
  "VELOCITY_16": 42,
  "VELOCITY_17": 43,
  "VELOCITY_18": 44,
  "VELOCITY_19": 45,
  "VELOCITY_20": 46,
  "VELOCITY_21": 47,
  "VELOCITY_22": 48,
  "VELOCITY_23": 49,
  "VELOCITY_24": 50,
  "VELOCITY_25": 51,
  "VELOCITY_26": 52,
  "VELOCITY_27": 53,
  "VELOCITY_28": 54,
  "VELOCITY_29": 55,
  "VELOCITY_30": 56,
  "VELOCITY_31": 57,
  "VELOCITY_32": 58,
  "VELOCITY_33": 59,
  "VELOCITY_34": 60,
  "VELOCITY_35": 61,
  "VELOCITY_36": 62,
  "VELOCITY_37": 63,
  "VELOCITY_38": 64,
  "VELOCITY_39": 65,
  "VELOCITY_40": 66,
  "VELOCITY_41": 67,
  "VELOCITY_42": 68,
  "VELOCITY_43": 69,
  "VELOCITY_44": 70,
  "VELOCITY_45": 71,
  "VELOCITY_46": 72,
  "VELOCITY_47": 73,
  "VELOCITY_48": 74,
  "VELOCITY_49": 75,
  "VELOCITY_50": 76,
  "VELOCITY_51": 77,
  "VELOCITY_52": 78,
  "VELOCITY_53": 79,
  "VELOCITY_54": 80,
  "VELOCITY_55": 81,
  "VELOCITY_56": 82,
  "VELOCITY_57": 83,
  "VELOCITY_58": 84,
  "VELOCITY_59": 85,
  "VELOCITY_60": 86,
  "VELOCITY_61": 87,
  "VELOCITY_62": 88,
  "VELOCITY_63": 89,
  "VELOCITY_64": 90,
  "VELOCITY_65": 91,
  "VELOCITY_66": 92,
  "VELOCITY_67": 93,
  "VELOCITY_68": 94,
  "VELOCITY_69": 95,
  "VELOCITY_70": 96,
  "VELOCITY_71": 97,
  "VELOCITY_72": 98,
  "VELOCITY_73": 99,
  "VELOCITY_74": 100,
  "VELOCITY_75": 101,
  "VELOCITY_76": 102,
  "VELOCITY_77": 103,
  "VELOCITY_78": 104,
  "VELOCITY_79": 105,
  "VELOCITY_80": 106,
  "VELOCITY_81": 107,
  "VELOCITY_82": 108,
  "VELOCITY_83": 109,
  "VELOCITY_84": 110,
  "VELOCITY_85": 111,
  "VELOCITY_86": 112,
  "VELOCITY_87": 113,
  "VELOCITY_88": 114,
  "VELOCITY_89": 115,
  "VELOCITY_90": 116,
  "VELOCITY_91": 117,
  "VELOCITY_92": 118,
  "VELOCITY_93": 119,
  "VELOCITY_94": 120,
  "VELOCITY_95": 121,
  "VELOCITY_96": 122,
  "VELOCITY_97": 123,
  "VELOCITY_98": 124,
  "VELOCITY_99": 125,
  "VELOCITY_100": 126,
  "VELOCITY_101": 127,
  "VELOCITY_102": 128,
  "VELOCITY_103": 129,
  "VELOCITY_104": 130,
  "VELOCITY_105": 131,
  "VELOCITY_106": 132,
  "VELOCITY_107": 133,
  "VELOCITY_108": 134,
  "VELOCITY_109": 135,
  "VELOCITY_110": 136,
  "VELOCITY_111": 137,
  "VELOCITY_112": 138,
  "VELOCITY_113": 139,
  "VELOCITY_114": 140,
  "VELOCITY_115": 141,
  "VELOCITY_116": 142,
  "VELOCITY_117": 143,
  "VELOCITY_118": 144,
  "VELOCITY_119": 145,
  "VELOCITY_120": 146,
  "VELOCITY_121": 147,
  "VELOCITY_122": 148,
  "VELOCITY_123": 149,
  "VELOCITY_124": 150,
  "VELOCITY_125": 151,
  "VELOCITY_126": 152,
  "VELOCITY_127": 153,
  "NOTE_ON_0": 154,
  "NOTE_ON_1": 155,
  "NOTE_ON_2": 156,
  "NOTE_ON_3": 157,
  "NOTE_ON_4": 158,
  "NOTE_ON_5": 159,
  "NOTE_ON_6": 160,
  "NOTE_ON_7": 161,
  "NOTE_ON_8": 162,
  "NOTE_ON_9": 163,
  "NOTE_ON_10": 164,
  "NOTE_ON_11": 165,
  "NOTE_ON_12": 166,
  "NOTE_ON_13": 167,
  "NOTE_ON_14": 168,
  "NOTE_ON_15": 169,
  "NOTE_ON_16": 170,
  "NOTE_ON_17": 171,
  "NOTE_ON_18": 172,
  "NOTE_ON_19": 173,
  "NOTE_ON_20": 174,
  "NOTE_ON_21": 175,
  "NOTE_ON_22": 176,
  "NOTE_ON_23": 177,
  "NOTE_ON_24": 178,
  "NOTE_ON_25": 179,
  "NOTE_ON_26": 180,
  "NOTE_ON_27": 181,
  "NOTE_ON_28": 182,
  "NOTE_ON_29": 183,
  "NOTE_ON_30": 184,
  "NOTE_ON_31": 185,
  "NOTE_ON_32": 186,
  "NOTE_ON_33": 187,
  "NOTE_ON_34": 188,
  "NOTE_ON_35": 189,
  "NOTE_ON_36": 190,
  "NOTE_ON_37": 191,
  "NOTE_ON_38": 192,
  "NOTE_ON_39": 193,
  "NOTE_ON_40": 194,
  "NOTE_ON_41": 195,
  "NOTE_ON_42": 196,
  "NOTE_ON_43": 197,
  "NOTE_ON_44": 198,
  "NOTE_ON_45": 199,
  "NOTE_ON_46": 200,
  "NOTE_ON_47": 201,
  "NOTE_ON_48": 202,
  "NOTE_ON_49": 203,
  "NOTE_ON_50": 204,
  "NOTE_ON_51": 205,
  "NOTE_ON_52": 206,
  "NOTE_ON_53": 207,
  "NOTE_ON_54": 208,
  "NOTE_ON_55": 209,
  "NOTE_ON_56": 210,
  "NOTE_ON_57": 211,
  "NOTE_ON_58": 212,
  "NOTE_ON_59": 213,
  "NOTE_ON_60": 214,
  "NOTE_ON_61": 215,
  "NOTE_ON_62": 216,
  "NOTE_ON_63": 217,
  "NOTE_ON_64": 218,
  "NOTE_ON_65": 219,
  "NOTE_ON_66": 220,
  "NOTE_ON_67": 221,
  "NOTE_ON_68": 222,
  "NOTE_ON_69": 223,
  "NOTE_ON_70": 224,
  "NOTE_ON_71": 225,
  "NOTE_ON_72": 226,
  "NOTE_ON_73": 227,
  "NOTE_ON_74": 228,
  "NOTE_ON_75": 229,
  "NOTE_ON_76": 230,
  "NOTE_ON_77": 231,
  "NOTE_ON_78": 232,
  "NOTE_ON_79": 233,
  "NOTE_ON_80": 234,
  "NOTE_ON_81": 235,
  "NOTE_ON_82": 236,
  "NOTE_ON_83": 237,
  "NOTE_ON_84": 238,
  "NOTE_ON_85": 239,
  "NOTE_ON_86": 240,
  "NOTE_ON_87": 241,
  "NOTE_ON_88": 242,
  "NOTE_ON_89": 243,
  "NOTE_ON_90": 244,
  "NOTE_ON_91": 245,
  "NOTE_ON_92": 246,
  "NOTE_ON_93": 247,
  "NOTE_ON_94": 248,
  "NOTE_ON_95": 249,
  "NOTE_ON_96": 250,
  "NOTE_ON_97": 251,
  "NOTE_ON_98": 252,
  "NOTE_ON_99": 253,
  "NOTE_ON_100": 254,
  "NOTE_ON_101": 255,
  "NOTE_ON_102": 256,
  "NOTE_ON_103": 257,
  "NOTE_ON_104": 258,
  "NOTE_ON_105": 259,
  "NOTE_ON_106": 260,
  "NOTE_ON_107": 261,
  "NOTE_ON_108": 262,
  "NOTE_ON_109": 263,
  "NOTE_ON_110": 264,
  "NOTE_ON_111": 265,
  "NOTE_ON_112": 266,
  "NOTE_ON_113": 267,
  "NOTE_ON_114": 268,
  "NOTE_ON_115": 269,
  "NOTE_ON_116": 270,
  "NOTE_ON_117": 271,
  "NOTE_ON_118": 272,
  "NOTE_ON_119": 273,
  "NOTE_ON_120": 274,
  "NOTE_ON_121": 275,
  "NOTE_ON_122": 276,
  "NOTE_ON_123": 277,
  "NOTE_ON_124": 278,
  "NOTE_ON_125": 279,
  "NOTE_ON_126": 280,
  "NOTE_ON_127": 281,
  "NOTE_OFF_0": 282,
  "NOTE_OFF_1": 283,
  "NOTE_OFF_2": 284,
  "NOTE_OFF_3": 285,
  "NOTE_OFF_4": 286,
  "NOTE_OFF_5": 287,
  "NOTE_OFF_6": 288,
  "NOTE_OFF_7": 289,
  "NOTE_OFF_8": 290,
  "NOTE_OFF_9": 291,
  "NOTE_OFF_10": 292,
  "NOTE_OFF_11": 293,
  "NOTE_OFF_12": 294,
  "NOTE_OFF_13": 295,
  "NOTE_OFF_14": 296,
  "NOTE_OFF_15": 297,
  "NOTE_OFF_16": 298,
  "NOTE_OFF_17": 299,
  "NOTE_OFF_18": 300,
  "NOTE_OFF_19": 301,
  "NOTE_OFF_20": 302,
  "NOTE_OFF_21": 303,
  "NOTE_OFF_22": 304,
  "NOTE_OFF_23": 305,
  "NOTE_OFF_24": 306,
  "NOTE_OFF_25": 307,
  "NOTE_OFF_26": 308,
  "NOTE_OFF_27": 309,
  "NOTE_OFF_28": 310,
  "NOTE_OFF_29": 311,
  "NOTE_OFF_30": 312,
  "NOTE_OFF_31": 313,
  "NOTE_OFF_32": 314,
  "NOTE_OFF_33": 315,
  "NOTE_OFF_34": 316,
  "NOTE_OFF_35": 317,
  "NOTE_OFF_36": 318,
  "NOTE_OFF_37": 319,
  "NOTE_OFF_38": 320,
  "NOTE_OFF_39": 321,
  "NOTE_OFF_40": 322,
  "NOTE_OFF_41": 323,
  "NOTE_OFF_42": 324,
  "NOTE_OFF_43": 325,
  "NOTE_OFF_44": 326,
  "NOTE_OFF_45": 327,
  "NOTE_OFF_46": 328,
  "NOTE_OFF_47": 329,
  "NOTE_OFF_48": 330,
  "NOTE_OFF_49": 331,
  "NOTE_OFF_50": 332,
  "NOTE_OFF_51": 333,
  "NOTE_OFF_52": 334,
  "NOTE_OFF_53": 335,
  "NOTE_OFF_54": 336,
  "NOTE_OFF_55": 337,
  "NOTE_OFF_56": 338,
  "NOTE_OFF_57": 339,
  "NOTE_OFF_58": 340,
  "NOTE_OFF_59": 341,
  "NOTE_OFF_60": 342,
  "NOTE_OFF_61": 343,
  "NOTE_OFF_62": 344,
  "NOTE_OFF_63": 345,
  "NOTE_OFF_64": 346,
  "NOTE_OFF_65": 347,
  "NOTE_OFF_66": 348,
  "NOTE_OFF_67": 349,
  "NOTE_OFF_68": 350,
  "NOTE_OFF_69": 351,
  "NOTE_OFF_70": 352,
  "NOTE_OFF_71": 353,
  "NOTE_OFF_72": 354,
  "NOTE_OFF_73": 355,
  "NOTE_OFF_74": 356,
  "NOTE_OFF_75": 357,
  "NOTE_OFF_76": 358,
  "NOTE_OFF_77": 359,
  "NOTE_OFF_78": 360,
  "NOTE_OFF_79": 361,
  "NOTE_OFF_80": 362,
  "NOTE_OFF_81": 363,
  "NOTE_OFF_82": 364,
  "NOTE_OFF_83": 365,
  "NOTE_OFF_84": 366,
  "NOTE_OFF_85": 367,
  "NOTE_OFF_86": 368,
  "NOTE_OFF_87": 369,
  "NOTE_OFF_88": 370,
  "NOTE_OFF_89": 371,
  "NOTE_OFF_90": 372,
  "NOTE_OFF_91": 373,
  "NOTE_OFF_92": 374,
  "NOTE_OFF_93": 375,
  "NOTE_OFF_94": 376,
  "NOTE_OFF_95": 377,
  "NOTE_OFF_96": 378,
  "NOTE_OFF_97": 379,
  "NOTE_OFF_98": 380,
  "NOTE_OFF_99": 381,
  "NOTE_OFF_100": 382,
  "NOTE_OFF_101": 383,
  "NOTE_OFF_102": 384,
  "NOTE_OFF_103": 385,
  "NOTE_OFF_104": 386,
  "NOTE_OFF_105": 387,
  "NOTE_OFF_106": 388,
  "NOTE_OFF_107": 389,
  "NOTE_OFF_108": 390,
  "NOTE_OFF_109": 391,
  "NOTE_OFF_110": 392,
  "NOTE_OFF_111": 393,
  "NOTE_OFF_112": 394,
  "NOTE_OFF_113": 395,
  "NOTE_OFF_114": 396,
  "NOTE_OFF_115": 397,
  "NOTE_OFF_116": 398,
  "NOTE_OFF_117": 399,
  "NOTE_OFF_118": 400,
  "NOTE_OFF_119": 401,
  "NOTE_OFF_120": 402,
  "NOTE_OFF_121": 403,
  "NOTE_OFF_122": 404,
  "NOTE_OFF_123": 405,
  "NOTE_OFF_124": 406,
  "NOTE_OFF_125": 407,
  "NOTE_OFF_126": 408,
  "NOTE_OFF_127": 409
}